# Операції та оператори
# присвоювання - підтримка кортежної форми
x, y, s = 10, 1e-2, 'string'
print(x, y, s)
# наприклад, обмін значеннями
x, y = y, x

# арифметичні операції
x, y = 10, 20
print(x + y, type(x + y))  # <class 'int'>
print(x - y, type(x - y))  # <class 'int'>
print(x * y, type(x * y))  # <class 'int'>
print(x / y, type(x), type(y), type(x / y))  # 0.5 <class 'int'> <class 'int'> <class 'float'>
# ! при діленні змінюється тип даних цілих аргументів
print(x // y, type(x // y))    # 0 <class 'int'> -- цілочислене ділення
print(x ** y, type(x ** y))    # 100000000000000000000 <class 'int'>
print(x % y, type(x % y))      # 10 <class 'int'> -- залишок від ділення
# рядкові операції
print(str(x) + str(y))         # 1020 - конкатенація
s = "x = %s, y = %s" % (x, y)  # інтерполяція - підстановка значень в рядок
print(s)                       # x = 10, y = 20
# для функціональних мов один оператор може мати різні дії з різними даними
# наприклад, % для чисел - залишок від ділення, а для рядків - інтерполяція
s = f"x = {x}, y = {y}"        # більш нова форма інтерполяції рядків
print(s)                       # x = 10, y = 20
s = "\\d+\\s*\t\\d+"           # "\" потрібно екранувати: "\\"
print(s)                       # \d+\s*  \d+
s = r"\d+\s*\t\d+"             # raw-string -- не проробляє спецсимволи, виводить як є
print(s)                       # \d+\s*\t\d+
'''Багаторядкові вирази також використовують
в якості довгих коментарів, а також ними задають
документуючі коментарі'''

# умовний оператор
if x < 10 and x > 0 :      # умови не беруть в дужки, сполучні оператори - літеральні (or and not)
    print("x")             # блок (тіло) оператора задається відступами від лівого краю
    print("in")            # величина відступу не грає ролі, але має бути однаковою в
    print("0..10")         # межах одного блоку.
elif not x >= 0 :          # elif - else if
  print("x")               # Новий блок може мати інші відступи,
  print("is")              # але однакові в межах блоку. Рекомендується
  print("negative")        # вживати однакові відступи для всіх блоків
elif x % 2 == 0 :          # Блоків elif
   print("x")              # може бути
   print("is")             # декілька, або не бути
   print("even")           # жодного
else :                     # Блок else може бути 
   print("nothing")        # тільки один, але не є
   print("aforementioned") # обов'язковим
                           # після блокового оператора прийнято лишати порожній рядок
# умовний вираз (тернарний)      
y = 10 if x > 0 else 20    # y = (x > 0) ? 10 : 20

# цикли: є два типи циклів - while та for-in, форми do-while немає
i = 0
while i < 10 :
   print(i, end=' ')   # іменований параметр end задає завершальний символ (\n)
   i += 1              # форми i++ немає
else :                 # Блок else виконується при порушенні циклової умови
   print()             # тобто при нормальному завершенні циклу (не виконується,
                       # якщо цикл перервано break)
# через відсутність форми do-while часто вживається нескінченний цикл з зупинкою
while True :           # Логічні константи пишуться з великої літери: True, False
   i += 1
   print(i, end=' ')
   if i >= 20 :
      print()
      break             
else:                  # недосяжний код - циклова умова
   print()             # не може бути порушена


# генератори - спеціальні об'єкти, що ітеруються, генеруючи послідовності
r = range(10)   # генератор - правило формування чисел від 0 до 9 (10-1)
print(r)        # range(0, 10)
for i in r :
   print(i+1, end=' ')
print()
# ~spread
print(*r)       # * "розкриває" множину або генератор і формує всі значення через ","

for i in range(1, 10, 2) :  # повна форма: початкове значення (включно)
   print(i, end=' ')        # кінцеве значення (виключно) і крок (дельта зміни)
print()

print(*range(10,1,-1))      # від'ємний крок - рух у зворотньому напрямі
                            # принцип невключності зберігається - кінець при і = 2
'''
Д.З. Забезпечити введення з консолі величин початку та кінця
діапазону, вивести усі числа з діапазону включно з межами.
Наприклад:
1 5
> 1 2 3 4 5

5 1 
> 5 4 3 2 1

5 5
> 5
'''                            