# Функції
# У мовах програмування, що реалізують функціональну 
# парадигму, бажано розрізняти терміни "функція" та
# "процедура". В цьому аспекті "функція" - базовий термін
# функціональної парадигми, ближчий до розуміння "лямбда".
# Процедура - "підпрограма", що викликається за іменем.

def say_hello() :   # def - оголошення функції, традиція: snake_case
    # перший рядок (string) після оголошення є документуючим коментарем
    '''Demo function prints "Hello"'''
    print( "Hello" )
                       # Між оголошеннями функцій прийнято
                       # залишати 2 порожні рядки (принаймні)
def say_hi(name:str) -> None :   # None - аналог NULL / void / undefined
    print( "Hi,", name )


def print_xy(x:int=10, y:int=20) -> None :   # значення за замовчанням
    print(x, y)


def print_xy(x:int=10, y:int=20, t:int=30) -> None :   # перевантаження?
    print('x =', x, 'y = ', y, 't = ', t)    # Не перевантаження а переозначення
# У Python немає перевантаження функцій, у той же час немає помилки
# переозначення. Оголошення функції ближче до операції присвоєння:
# повторне оголошення переприсвоює тіло функції незалежно від кількості/типів
# їх параметрів. Тому традиційно функції широкого призначення мають 
# велику кількість параметрів за замовчанням.

# чи можлива рекурсія? - можлива
def factorial(n:int) -> int:   # n! = 1*2*3*...*n = n*(n-1)!
    # 1 вихід за умови досягення певних значень
    if n <= 1 :
        return 1
    # 2 виклик цієї ж функції зі зміненим аргументом
    return n * factorial(n - 1)

# Алгоритм Євкліда для пошуку найбільшого спільного дільника 
# двох чисел А і В: якщо А і В мають спільний дільник, то
# залишок ділення А і В також ділиться на цей дільник.
# gcd(a,b) = gcd(b, a%b) якщо a < b, інакше =gcd(b, a)
def gcd(a:int, b:int) -> int:
    if a < b :
        return gcd(b, a)
    elif b == 0 :
        return a
    else :
        return gcd(b, a % b)

# взаємодія з оточенням, області видності
w = 10  # глобальна змінна - поза тілом функцій
                                 # Правило розкриття літералів (пошуку імен)
def get_w() :                    # Для кожної операції здійснюється пошук найближчого
    return w                     # доступного літералу (імені змінної)
                                 # - локальна область (тіло функції)
                                 # - параметрична (перелік параметрів функції)
def set_w(value:int) -> None :   # - capture / closure
    w = value                    # - глобальна область (поза функцією)
                                 # Особливість у тому, що відповідь на пошук
                                 # відрізняється за типом операцій: читання чи запис
                                 # get_w - на читання -- глобальна
                                 # set_w - на запис (створення) -- локальна
def set_gw(value:int) -> None :  # Для того щоб зазначити, що звернення іде
    global w                     # саме до глобальної змінної, вживається 
    w = value                    # оператор global


# варіадичність - прийом довільної кількості аргументів
def show(*args) -> None :   # args - tuple - кортеж переданих аргументів
    for arg in args :
        print(arg, end=" ")
    print()


def show_kw(**kwargs) -> None :  # keyword arguments - іменовані аргументи
    for k, v in kwargs.items() : # kwargs - dict - словник аргументів
        print(k, ' => ', v)  
                                   


# У Python діє модульний принцип - файли можуть підключатись
# до інших файлів як модулі (import), під час підключення
# код файлу виконується. Під час виконання в файл передається
# назва модуля __name__ з якою він підключається. Якщо файл
# викликається як самостійна програма, то її значення: __main__

def main() :
    pass               # pass - порожня операція (замість порожнього блоку)
    say_hello()
    say_hi('User')     # обидві виконуються, хоча в оголошенні вказано :str
    say_hi(123)        # - типізація є швидше підказкою, а не обмеженням
    print_xy(1,2)      # позиційні та іменовані аргументи - дозволяють
    print_xy(1)        # використовувати значення за замовчанням
    print_xy(y=2)      # у довільних комбінаціях з переданими.
    print_xy(y=1,x=2)  # 
    print_xy(y=1,t=2)  # 
    print( factorial(5) )
    print( factorial(6) )
    print( gcd(16, 12) )  # 4
    print( gcd(12, 15) )  # 3
    print( gcd(12, 14) )  # 2
    print( gcd(12, 13) )  # 1
    print( gcd(12, 12) )  # 12

    print( get_w() )      # 10
    set_w(20)
    print( get_w() )      # 10
    set_gw(20)
    print( get_w() )      # 20

    show(1)
    show(1, 2)
    show(1, 2, 'a')
    data = (4,5,6,'b')
    show(data)          # (4, 5, 6, 'b') - як один аргумент
    show(*data)         # 4 5 6 b - як перелік параметрів

    show_kw(x=10, y=20, name='User')
    data = {'x': 10, 'y': 20}
    # show_kw(data)  TypeError: show_kw() takes 0 positional arguments but 1 was given
    show_kw(**data)  # x  =>  10  y  =>  20


if __name__ == '__main__' :
    main()


'''
Д.З. Описати варіадичну функцію з прийомом як позиційних,
так і іменованих аргументів.
Якщо серед іменованих аргументів є "name", то вивести Hello, name
Серед позиційних аргументів підрахувати суму числових даних
(інші ігнорувати), також вивести результат
'''